MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timera.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_timera.c
 **
 ** A detailed description is available at
 ** @link TimeraGroup Timer A description @endlink
 **
 **   - 2018-11-08  1.0  Yangjp  First version for Device Driver Library of
 **                      Timera.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_timera.h"
#include "hc32f46x_utility.h"

#if (DDL_TIMERA_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup TimeraGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for normal timera unit */
#define IS_VALID_NORMAL_TIMERA_UNIT(x) \
    ((M4_TMRA1 == (x)) ||              \
     (M4_TMRA2 == (x)) ||              \
     (M4_TMRA3 == (x)) ||              \
     (M4_TMRA4 == (x)) ||              \
     (M4_TMRA5 == (x)) ||              \
     (M4_TMRA6 == (x)))

/*!< Parameter valid check for sync startup timera unit */
#define IS_VALID_SYNC_STARTUP_TIMERA_UNIT(x) \
    ((M4_TMRA2 == (x)) ||                    \
     (M4_TMRA3 == (x)) ||                    \
     (M4_TMRA4 == (x)) ||                    \
     (M4_TMRA5 == (x)) ||                    \
     (M4_TMRA6 == (x)))

/*!< Parameter valid check for Count clock division */
#define IS_VALID_COUNT_CLK_DIV(x) \
    ((TimeraPclkDiv1 == (x)) ||   \
     (TimeraPclkDiv2 == (x)) ||   \
     (TimeraPclkDiv4 == (x)) ||   \
     (TimeraPclkDiv8 == (x)) ||   \
     (TimeraPclkDiv16 == (x)) ||  \
     (TimeraPclkDiv32 == (x)) ||  \
     (TimeraPclkDiv64 == (x)) ||  \
     (TimeraPclkDiv128 == (x)) || \
     (TimeraPclkDiv256 == (x)) || \
     (TimeraPclkDiv512 == (x)) || \
     (TimeraPclkDiv1024 == (x)))

/*!< Parameter valid check for count mode */
#define IS_VALID_COUNT_MODE(x)               \
    ((TimeraCountModeSawtoothWave == (x)) || \
     (TimeraCountModeTriangularWave == (x)))

/*!< Parameter valid check for count direction */
#define IS_VALID_COUNT_DIR(x)     \
    ((TimeraCountDirUp == (x)) || \
     (TimeraCountDirDown == (x)))

/*!< Parameter valid check for normal timera channel */
#define IS_VALID_NORMAL_TIMERA_CHANNEL(x) \
    ((TimeraCh1 == (x)) ||                \
     (TimeraCh2 == (x)) ||                \
     (TimeraCh3 == (x)) ||                \
     (TimeraCh4 == (x)) ||                \
     (TimeraCh5 == (x)) ||                \
     (TimeraCh6 == (x)) ||                \
     (TimeraCh7 == (x)) ||                \
     (TimeraCh8 == (x)))

/*!< Parameter valid check for set cache channel */
#define IS_VALID_SET_CACHE_CHANNEL(x) \
    ((TimeraCh1 == (x)) ||            \
     (TimeraCh3 == (x)) ||            \
     (TimeraCh5 == (x)) ||            \
     (TimeraCh7 == (x)))

/*!< Parameter valid check for enable cache channel */
#define IS_VALID_ENABLE_CACHE_CHANNEL(x) \
    ((TimeraCh1 == (x)) ||               \
     (TimeraCh3 == (x)) ||               \
     (TimeraCh5 == (x)) ||               \
     (TimeraCh7 == (x)))

/*!< Parameter valid check for timera count start output status */
#define IS_VALID_COUNT_START_OUTPUT(x)      \
    ((TimeraCountStartOutputLow == (x)) ||  \
     (TimeraCountStartOutputHigh == (x)) || \
     (TimeraCountStartOutputKeep == (x)))

/*!< Parameter valid check for timera count stop output status */
#define IS_VALID_COUNT_STOP_OUTPUT(x)      \
    ((TimeraCountStopOutputLow == (x)) ||  \
     (TimeraCountStopOutputHigh == (x)) || \
     (TimeraCountStopOutputKeep == (x)))

/*!< Parameter valid check for compare match output status */
#define IS_VALID_COMPARE_MATCH_OUTPUT(x)      \
    ((TimeraCompareMatchOutputLow == (x)) ||  \
     (TimeraCompareMatchOutputHigh == (x)) || \
     (TimeraCompareMatchOutputKeep == (x)) || \
     (TimeraCompareMatchOutputReverse == (x)))

/*!< Parameter valid check for period match output status */
#define IS_VALID_PERIOD_MATCH_OUTPUT(x)      \
    ((TimeraPeriodMatchOutputLow == (x)) ||  \
     (TimeraPeriodMatchOutputHigh == (x)) || \
     (TimeraPeriodMatchOutputKeep == (x)) || \
     (TimeraPeriodMatchOutputReverse == (x)))

