MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timera.c
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable Timera interrupt request
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] enIrq                   Timera interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh1   Channel 1 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh2   Channel 2 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh3   Channel 3 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh4   Channel 4 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh5   Channel 5 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh6   Channel 6 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh7   Channel 7 interrupt request
 ** \arg TimeraIrqCaptureOrCompareCh8   Channel 8 interrupt request
 ** \arg TimeraIrqOverflow              Count overflow interrupt request
 ** \arg TimeraIrqUnderflow             Count underflow interrupt request
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable timera interrupt request
 ** \arg Enable                         Enable timera interrupt request
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **
 ******************************************************************************/
en_result_t TIMERA_IrqCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_irq_type_t enIrq,
                          en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        DDL_ASSERT(IS_VALID_IRQ_SOURCE(enIrq));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

        switch (enIrq)
        {
        case TimeraIrqCaptureOrCompareCh1:
            TIMERAx->ICONR_f.ITEN1 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh2:
            TIMERAx->ICONR_f.ITEN2 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh3:
            TIMERAx->ICONR_f.ITEN3 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh4:
            TIMERAx->ICONR_f.ITEN4 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh5:
            TIMERAx->ICONR_f.ITEN5 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh6:
            TIMERAx->ICONR_f.ITEN6 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh7:
            TIMERAx->ICONR_f.ITEN7 = enNewSta;
            break;
        case TimeraIrqCaptureOrCompareCh8:
            TIMERAx->ICONR_f.ITEN8 = enNewSta;
            break;
        case TimeraIrqOverflow:
            TIMERAx->BCSTR_f.ITENOVF = enNewSta;
            break;
        case TimeraIrqUnderflow:
            TIMERAx->BCSTR_f.ITENUDF = enNewSta;
            break;
        default:
            break;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enable or disable Timera event request
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] enChannel               Timera event request channel
 ** \arg TimeraCh1                      Timera channel 1
 ** \arg TimeraCh2                      Timera channel 2
 ** \arg TimeraCh3                      Timera channel 3
 ** \arg TimeraCh4                      Timera channel 4
 ** \arg TimeraCh5                      Timera channel 5
 ** \arg TimeraCh6                      Timera channel 6
 ** \arg TimeraCh7                      Timera channel 7
 ** \arg TimeraCh8                      Timera channel 8
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable timera event request
 ** \arg Enable                         Enable timera event request
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **
 ******************************************************************************/
en_result_t TIMERA_EventCmd(M4_TMRA_TypeDef *TIMERAx, en_timera_channel_t enChannel,
                            en_functional_state_t enNewSta)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        DDL_ASSERT(IS_VALID_NORMAL_TIMERA_CHANNEL(enChannel));

        switch (enChannel)
        {
        case TimeraCh1:
            TIMERAx->ECONR_f.ETEN1 = enNewSta;
            break;
        case TimeraCh2:
            TIMERAx->ECONR_f.ETEN2 = enNewSta;
            break;
        case TimeraCh3:
            TIMERAx->ECONR_f.ETEN3 = enNewSta;
            break;
        case TimeraCh4:
            TIMERAx->ECONR_f.ETEN4 = enNewSta;
            break;
        case TimeraCh5:
            TIMERAx->ECONR_f.ETEN5 = enNewSta;
            break;
        case TimeraCh6:
            TIMERAx->ECONR_f.ETEN6 = enNewSta;
            break;
        case TimeraCh7:
            TIMERAx->ECONR_f.ETEN7 = enNewSta;
            break;
        case TimeraCh8:
            TIMERAx->ECONR_f.ETEN8 = enNewSta;
            break;
        default:
            break;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timera flag status
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] enFlag                  Timera flag type
 ** \arg TimeraFlagCaptureOrCompareCh1  Channel 1 match flag
 ** \arg TimeraFlagCaptureOrCompareCh2  Channel 2 match flag
 ** \arg TimeraFlagCaptureOrCompareCh3  Channel 3 match flag
 ** \arg TimeraFlagCaptureOrCompareCh4  Channel 4 match flag
 ** \arg TimeraFlagCaptureOrCompareCh5  Channel 5 match flag
 ** \arg TimeraFlagCaptureOrCompareCh6  Channel 6 match flag
 ** \arg TimeraFlagCaptureOrCompareCh7  Channel 7 match flag
 ** \arg TimeraFlagCaptureOrCompareCh8  Channel 8 match flag
 ** \arg TimeraFlagOverflow             Count overflow flag
 ** \arg TimeraFlagUnderflow            Count underflow flag
 **
 ** \retval Set                         Flag is set
 ** \retval Reset                       Flag is reset
 **
 ******************************************************************************/
en_flag_status_t TIMERA_GetFlag(M4_TMRA_TypeDef *TIMERAx, en_timera_flag_type_t enFlag)
{
    en_flag_status_t enFlagSta = Reset;

    /* Check parameters */
    if (IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        DDL_ASSERT(IS_VALID_FLAG_TYPE(enFlag));

        switch (enFlag)
        {
        case TimeraFlagCaptureOrCompareCh1:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF1;
            break;
        case TimeraFlagCaptureOrCompareCh2:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF2;
            break;
        case TimeraFlagCaptureOrCompareCh3:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF3;
            break;
        case TimeraFlagCaptureOrCompareCh4:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF4;
            break;
        case TimeraFlagCaptureOrCompareCh5:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF5;
            break;
        case TimeraFlagCaptureOrCompareCh6:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF6;
            break;
        case TimeraFlagCaptureOrCompareCh7:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF7;
            break;
        case TimeraFlagCaptureOrCompareCh8:
            enFlagSta = (en_flag_status_t)TIMERAx->STFLR_f.CMPF8;
            break;
        case TimeraFlagOverflow:
            enFlagSta = (en_flag_status_t)TIMERAx->BCSTR_f.OVFF;
            break;
        case TimeraFlagUnderflow:
            enFlagSta = (en_flag_status_t)TIMERAx->BCSTR_f.UDFF;
            break;
        default:
            break;
        }
    }

