MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timera.c
    return enFlagSta;
}

/**
 *******************************************************************************
 ** \brief Clear Timera flag status
 **
 ** \param [in] TIMERAx                 Pointer to timera unit configuration address
 ** \arg M4_TMRA1                       Timera unit 1 configuration Address
 ** \arg M4_TMRA2                       Timera unit 2 configuration Address
 ** \arg M4_TMRA3                       Timera unit 3 configuration Address
 ** \arg M4_TMRA4                       Timera unit 4 configuration Address
 ** \arg M4_TMRA5                       Timera unit 5 configuration Address
 ** \arg M4_TMRA6                       Timera unit 6 configuration Address
 **
 ** \param [in] enFlag                  Timera flag type
 ** \arg TimeraFlagCaptureOrCompareCh1  Channel 1 match flag
 ** \arg TimeraFlagCaptureOrCompareCh2  Channel 2 match flag
 ** \arg TimeraFlagCaptureOrCompareCh3  Channel 3 match flag
 ** \arg TimeraFlagCaptureOrCompareCh4  Channel 4 match flag
 ** \arg TimeraFlagCaptureOrCompareCh5  Channel 5 match flag
 ** \arg TimeraFlagCaptureOrCompareCh6  Channel 6 match flag
 ** \arg TimeraFlagCaptureOrCompareCh7  Channel 7 match flag
 ** \arg TimeraFlagCaptureOrCompareCh8  Channel 8 match flag
 ** \arg TimeraFlagOverflow             Count overflow flag
 ** \arg TimeraFlagUnderflow            Count underflow flag
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - TIMERAx is invalid
 **
 ******************************************************************************/
en_result_t TIMERA_ClearFlag(M4_TMRA_TypeDef *TIMERAx, en_timera_flag_type_t enFlag)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (IS_VALID_NORMAL_TIMERA_UNIT(TIMERAx))
    {
        DDL_ASSERT(IS_VALID_FLAG_TYPE(enFlag));

        switch (enFlag)
        {
        case TimeraFlagCaptureOrCompareCh1:
            TIMERAx->STFLR_f.CMPF1 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh2:
            TIMERAx->STFLR_f.CMPF2 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh3:
            TIMERAx->STFLR_f.CMPF3 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh4:
            TIMERAx->STFLR_f.CMPF4 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh5:
            TIMERAx->STFLR_f.CMPF5 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh6:
            TIMERAx->STFLR_f.CMPF6 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh7:
            TIMERAx->STFLR_f.CMPF7 = 0u;
            break;
        case TimeraFlagCaptureOrCompareCh8:
            TIMERAx->STFLR_f.CMPF8 = 0u;
            break;
        case TimeraFlagOverflow:
            TIMERAx->BCSTR_f.OVFF = 0u;
            break;
        case TimeraFlagUnderflow:
            TIMERAx->BCSTR_f.UDFF = 0u;
            break;
        default:
            break;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set counter event trigger source
 **
 ** \param [in] enTriggerSrc            Counter event trigger source
 ** \arg 0-511                          Used to trigger counter start/stop/clear/increment/decrement
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t TIMERA_SetCountTriggerSrc(en_event_src_t enTriggerSrc)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_EVENT_SOURCE(enTriggerSrc));

    M4_AOS->TMRA_HTSSR0 = enTriggerSrc;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set capture event trigger source
 **
 ** \param [in] enTriggerSrc            Capture event trigger source
 ** \arg 0-511                          Used to trigger the capture function
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t TIMERA_SetCaptureTriggerSrc(en_event_src_t enTriggerSrc)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_EVENT_SOURCE(enTriggerSrc));

    M4_AOS->TMRA_HTSSR1 = enTriggerSrc;

    return enRet;
}

//@} // TimeraGroup

#endif /* DDL_TIMERA_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
